{
    "skillmessage": "Programming languages and tools skillset",
    "education": [
        {
            "school": "McGill University",
            "degree": "Masters in Electrical Engineering",
            "graduated": "December 2019",
            "description": "I wrote a thesis on the IOTA distributed ledger with a pharmaceutical use-case with IoT sensors. I have gained extensive knowledge on the blockchain but also on energy efficient ways of integrating IoT sensors with a decentralized system",
            "image": "mcgill.png"
        },
        {
            "school": "McGill University",
            "degree": "Bachelor in Electrical Engineering",
            "graduated": "April 2015",
            "description": "Learned the basics of electrical engineering and microprocessor systems programming. I have discovered my love for software development in my elective courses where I learned how microprocessors worked and how to control their peripherals (GPIO, ADC/DAC, sensors, UART, etc.)",
            "image": "mcgill.png"
        }
    ],
    "work": [
        {
            "company": "Alten",
            "title": "Software Developer",
            "years": "December 2020 - Present",
            "description": [
                "Consultant for Zimmer-Biomet",
                "Worked for client (CMC electronics) in tools team on C++ software design of Avionics simulation/training tool",
                "Configure and customize Part-Task Trainers (training device for selected aircraft and tasks that simulates real time flight performance and display systems) for customers"
            ],
            "image": "alten.png"
        },
        {
            "company": "Onepoint",
            "title": "Software Developer",
            "years": "May 2019 - December 2020",
            "description": [
                "Worked for client (Humanware) on C++ application software development on ARM microprocessor platform for low vision aids purpose",
                "Implemented device USB & Bluetooth connectivity to PC/Mac/iOS/Android host using BlueZ Linux stack and USB HID gadget driver. Added device bluetooth HID connectivity with multiple hosts and ability to switch connection",
                "Developed Bash tests for production to verify basic hardware and software functionalities (Wifi, Bluetooth, LED, vibration, etc.)",
                "Modified Linux Buildroot kernel & external packages and device tree to assign the hardware GPIO mappings",
                "Provided advice to client to implement Gitflow, improved code review methodology and software development practices"
            ],
            "image": "onepoint.png"
        },
        {
            "company": "Octasic",
            "title": "Software Developer",
            "years": "May 2018 - May 2019",
            "description": [
                "Developed RF wireless (GSM, UMTS, LTE, etc.) embedded control and diagnostic tools (Python, C, C++) for internal hardware team",
                "Built RESTful API Web server (POCO C++ library backend) on Beaglebone Black to control board power amplifiers, switches, GPIO, etc. (Atmel microprocessors) with TCP socket communication",
                "Designed & programmed a single-page application web application to visualize performance and control the RF embedded system (Vanilla Javascript/HTML/CSS & Flask library for simulation)",
                "Improved and maintain the build machine multi-UE (multiple RF bandwidth frequencies) automated testing system with Python script modules and using Pytest framework with Jenkins build server"
            ],
            "image": "octasic.png"
        }
    ],
    "skills": [
        {
            "name": "Python",
            "level": "70%",
            "image": "python.png",
            "description": "I use Python for task automation, CI scripting and for functional tests. It is also my favorite language to toy around and to develop for personal projects."
        },
        {
            "name": "C++",
            "level": "60%",
            "image": "cplusplus.png",
            "description": "I have worked with C++ for server backend on a RESTful API server with the POCO library. I have also developed Linux application and Windows graphical user interface with QT library."
        },
        {
            "name": "C",
            "level": "60%",
            "image": "c.png",
            "description": "I have used C for Atmel microprocessor development with FreeRTOS and also for STM boards during university."
        },
        {
            "name": "Git",
            "level": "70%",
            "image": "git.png",
            "description": "Git is the verion control I have used for every single professional and personal project."
        },
        {
            "name": "Visual Studio",
            "level": "70%",
            "image": "visualstudio.png",
            "description": "Visual Studio and Visual Studio code are the main IDE I have worked with to develop C++, C and Python code."
        },
        {
            "name": "Jenkins/Gitlab CI",
            "level": "60%",
            "image": "jenkins.png",
            "description": "Jenkins is the autumation server I have used for software continuous integration and delivery."
        }
    ]
}